In [1]:
import pandas as pd

In [4]:
pd.Series([10,20,30])

0    10
1    20
2    30
dtype: int64

In [5]:
s1=pd.Series([10,20,30])
s1 [0:2]

0    10
1    20
dtype: int64

In [6]:
col_idx=['A','B','C']
data = [10,20,30]
pd.Series(data,index=col_idx)

A    10
B    20
C    30
dtype: int64

In [9]:
dict_data={'A':10, 'B':20, 'C':30}
type(dict_data)
s3=pd.Series(dict_data)

In [10]:
s3

A    10
B    20
C    30
dtype: int64

In [11]:
# 리스트로 시리즈 생성
data = [1, 2, 3, 4, 5]
s1 = pd.Series(data)
print(s1)

# 인덱스 지정하여 시리즈 생성
data = [1, 2, 3, 4, 5]
index = ['a', 'b', 'c', 'd', 'e']
s2 = pd.Series(data, index=index)
print(s2)

# 딕셔너리로 시리즈 생성 - 키가 인덱스가 됨
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)
print(s3)

0    1
1    2
2    3
3    4
4    5
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64
a    1
b    2
c    3
d    4
dtype: int64

In [13]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])  # 9776 출력
print(population[['서울', '부산']])  # 서울과 부산의 데이터만 선택

9776
서울    9776
부산    2729
dtype: int64

In [14]:
# 리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
print(df)

# 열 이름 지정하여 생성
df = pd.DataFrame(data, columns=['A', 'B', 'C'])
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [15]:
class Account:
    def __init__(self, owner, balance):
        self.owner = owner      # 인스턴스 변수
        self.balance = balance  # 인스턴스 변수

In [16]:
acc1 = Account("홍길동", 1000)
acc2 = Account("김철수", 5000)

In [17]:
Account

__main__.Account

In [4]:
population = pd.Series([9776.0, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])  # 9776 출력
print(population[['서울', '인천']])  # 서울과 부산의 데이터만 선택

9776.0
서울    9776.0
인천    1566.0
dtype: float64

In [7]:
population [['서울','인천']]

서울    9776.0
인천    1566.0
dtype: float64

In [8]:
population['제주']=20

In [9]:
population

서울    9776.0
부산    2729.0
인천    1566.0
대구    3158.0
제주      20.0
dtype: float64

In [10]:
population['제주']=50

In [11]:
population

서울    9776.0
부산    2729.0
인천    1566.0
대구    3158.0
제주      50.0
dtype: float64

In [ ]:
#데이터프레임

In [12]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [15]:
pd.DataFrame(data, columns=['A','B','C'], index=['쿠키','스낵','케익'])

    A  B  C
쿠키  1  2  3
스낵  4  5  6
케익  7  8  9

In [2]:
import numpy as np
import pandas as pd

# 2차원 넘파이 어레이 생성
arr = np.array([[1, 2, 3],
                [4, 5, 6],
                [7, 8, 9]])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [17]:
pd.DataFrame(arr, columns=['A','B','C'], index=['쿠키','스낵','케익'])

    A  B  C
쿠키  1  2  3
스낵  4  5  6
케익  7  8  9

In [18]:
# 시리즈 생성
names = pd.Series(['김철수', '이영희', '박민수'])
ages = pd.Series([25, 28, 22])
scores = pd.Series([85, 92, 78])
names, ages, scores

(0    김철수
 1    이영희
 2    박민수
 dtype: object,
 0    25
 1    28
 2    22
 dtype: int64,
 0    85
 1    92
 2    78
 dtype: int64)

In [20]:
#pd.DataFrame([names, ages, scores])
pd.DataFrame({
  '이름':names,
  '나이':ages,
  '점수':scores
})

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78

In [21]:
data = {
    '이름': ['김철수', '이영희', '박민수'],
    '나이': [25, 28, 22],
    '점수': [85, 92, 78]
}
df = pd.DataFrame(data)
print(df)

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78

In [ ]:
# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)

In [3]:
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호',
           '한미래', '윤지원', '오세훈', '장하늘', '백지은'],
    '나이': [25, 28, 22, 31, 27, 24, 29, 26, 30, 23],
    '점수': [85, 92, 78, 95, 88, 73, 91, 84, 90, 76]
}

df = pd.DataFrame(data)

In [11]:
import pandas as pd

data = {
    'name': ['김철수', '이영희', '박민수', '정수진', '최영호',
           '한미래', '윤지원', '오세훈', '장하늘', '백지은'],
    'age': [25, 28, 22, 31, 27, 24, 29, 26, 30, 23],
    'score': [85, 92, 78, 95, 88, 73, 91, 84, 90, 76]
}

df = pd.DataFrame(data)
df

  name  age  score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91
7  오세훈   26     84
8  장하늘   30     90
9  백지은   23     76

In [27]:
df.index=['A','B','C','D','E','F','G','H','I','J']
print(df.index)

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'], dtype='object')

In [15]:
#df.rename(columns={'name':'이름'}, inplace=False)
#df

In [ ]:
#inplace보다는 새로운 df 복사본에서 확인하는 방법이 안전하다.

In [28]:
df1=df.rename(columns={'name':'이름'})
df1

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91
H  오세훈   26     84
I  장하늘   30     90
J  백지은   23     76

In [29]:
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91
H  오세훈   26     84
I  장하늘   30     90
J  백지은   23     76

In [30]:
#미리보기
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, A to J
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10 non-null     object
 1   age     10 non-null     int64
 2   score   10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 320.0+ bytes

In [31]:
df.head(3)

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78

In [32]:
df.tail(3)

  name  age  score
H  오세훈   26     84
I  장하늘   30     90
J  백지은   23     76

In [33]:
df.describe()

            age      score
count  10.00000  10.000000
mean   26.50000  85.200000
std     3.02765   7.405704
min    22.00000  73.000000
25%    24.25000  79.500000
50%    26.50000  86.500000
75%    28.75000  90.750000
max    31.00000  95.000000

In [ ]:
#인덱싱과 슬라이싱 연습
기본인덱싱 []
행기반 iloc[]  >> [행, 열]
위치기반 loc[]  인덱싱 >> [행이름,열이름]

>> start:end 까지 슬라이싱
loc[행이름:행이름]
iloc[행번호:행번호] >>end 행번호는 -1까지

In [43]:
df1[['이름','age']]
df1.loc[:, ['이름','age']] #행과 열을 지정해줘야 한다.

    이름  age
A  김철수   25
B  이영희   28
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24
G  윤지원   29
H  오세훈   26
I  장하늘   30
J  백지은   23

In [35]:
df1.loc['A']

이름       김철수
age       25
score     85
Name: A, dtype: object

In [36]:
df1.iloc[0:3]

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78

In [37]:
df1.iloc[0:3, 0:2]

    이름  age
A  김철수   25
B  이영희   28
C  박민수   22

In [38]:
print(df.loc['A'])

name     김철수
age       25
score     85
Name: A, dtype: object

In [45]:
df1.loc[:,['이름']]

    이름
A  김철수
B  이영희
C  박민수
D  정수진
E  최영호
F  한미래
G  윤지원
H  오세훈
I  장하늘
J  백지은

In [46]:
df1['이름']

A    김철수
B    이영희
C    박민수
D    정수진
E    최영호
F    한미래
G    윤지원
H    오세훈
I    장하늘
J    백지은
Name: 이름, dtype: object

In [47]:
df1.loc[:,['이름','score']]

    이름  score
A  김철수     85
B  이영희     92
C  박민수     78
D  정수진     95
E  최영호     88
F  한미래     73
G  윤지원     91
H  오세훈     84
I  장하늘     90
J  백지은     76

In [51]:
df1.loc[['C'],:]

    이름  age  score
C  박민수   22     78

In [52]:
df1.loc[['D'],['age']]

   age
D   31

In [55]:
df1.loc['B':'E',:]

    이름  age  score
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88

In [56]:
df1.loc['C':'F','이름':'age']

    이름  age
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24

In [57]:
df1.loc['A':'G','score']

A    85
B    92
C    78
D    95
E    88
F    73
G    91
Name: score, dtype: int64

In [60]:
df1.loc[df1['age'] > 25]

    이름  age  score
B  이영희   28     92
D  정수진   31     95
E  최영호   27     88
G  윤지원   29     91
H  오세훈   26     84
I  장하늘   30     90

In [65]:
df1.loc[(df1['age'] > 25) & (df1['score']>90)]

    이름  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [66]:
df1.iloc[1,:]

이름       이영희
age       28
score     92
Name: B, dtype: object

In [69]:
df1.iloc[2,0]

'박민수'

In [71]:
df1.iloc[0:3,:]

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78

In [ ]:
#boolean 인덱싱

In [ ]:
df [df['score']>90] #vectorization boolean list의 요소값, True, False

  name  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [77]:
df1.loc[df1['age']>=27]

    이름  age  score
B  이영희   28     92
D  정수진   31     95
E  최영호   27     88
G  윤지원   29     91
I  장하늘   30     90

In [80]:
df1.loc[df1['score']>90, ['이름','score']]

    이름  score
B  이영희     92
D  정수진     95
G  윤지원     91

In [81]:
df1.loc[(df1['age'] > 25) & (df1['score']>90)]

    이름  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [82]:
df1.iloc[0]

이름       김철수
age       25
score     85
Name: A, dtype: object

In [84]:
df1.iloc[2,0]

'박민수'

In [86]:
df1.iloc[:3,]

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78

In [87]:
df1.iloc[-1,2]

np.int64(76)

In [90]:
df1.iloc[0:5]

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88

In [91]:
df1.iloc[2:6, :2]

    이름  age
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24

In [92]:
df1.iloc[:, 1]

A    25
B    28
C    22
D    31
E    27
F    24
G    29
H    26
I    30
J    23
Name: age, dtype: int64

In [94]:
df1.iloc[:4,2]

A    85
B    92
C    78
D    95
Name: score, dtype: int64

In [95]:
df1.iloc[-3:, ::2]

    이름  score
H  오세훈     84
I  장하늘     90
J  백지은     76

In [96]:
df1.iloc[-3:, [0,2]]

    이름  score
H  오세훈     84
I  장하늘     90
J  백지은     76

In [99]:
df.loc['K'] = ['장민호', 26, 88]

In [100]:
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91
H  장민호   26     88
I  장하늘   30     90
J  백지은   23     76
K  장민호   26     88

In [101]:
df['grade']=[1,2,3,4,5,6,7,8,9,10,11]

In [102]:
df

  name  age  score  grade
A  김철수   25     85      1
B  이영희   28     92      2
C  박민수   22     78      3
D  정수진   31     95      4
E  최영호   27     88      5
F  한미래   24     73      6
G  윤지원   29     91      7
H  장민호   26     88      8
I  장하늘   30     90      9
J  백지은   23     76     10
K  장민호   26     88     11